app/Models/ModelSatuan.php

    public function AllData()
    {
        return $this->db->table('tbl_satuan')->get()->getResultArray();
---
SELECT *
FROM `tbl_satuan`