app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tbl_user')->get()->getResultArray();
---
SELECT *
FROM `tbl_user`

    public function LoginUser($email, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '7110eda4d09e062aa5e4a390b0a572ac0d2c0220'